---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel
source: html/c031cf91-0561-d129-4dcc-967a6f0a1b3f.htm
---
# EnergyAnalysisDetailModel Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.